import ParallaxBackground from '@/components/parallax-background';
import QuestionItem from '@/pages/faq/components/section-faq/components/question-item';

export default function SectionFAQ() {
  return (
    <div className="relative min-h-screen">
      {/* <ParallaxBackground
        className="bg-contain opacity-20"
        backgroundImage="/images/photos/56.png"
      /> */}
      <div className="container relative z-10 p-24 pt-16">
        <h1 className="text-6xl mb-6 text-center font-serif text-black mb-12 mt-24">
          Питання та відповіді
        </h1>
        <ul>
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любиь трошки мене любиь трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
          <QuestionItem
            question="Як зробити щоб жінка хоть трошки мене любила?"
            answer="Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш,Ніяк особо не зробиш."
          />
        </ul>
      </div>
    </div>
  );
}
